# DehumidificationSetPoint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HVACLoadType..::..DehumidificationSetPoint Property
HVACLoadType Class See Also
---
The dehumidification set point as a number between 0 and 1.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public double DehumidificationSetPoint { get; set; }
```

Visual Basic
---
```text
Public Property DehumidificationSetPoint As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double DehumidificationSetPoint {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: |

# See Also
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace